/*
การบ้านวิชา For Loop:
พี่ปอองลองเขียนโปรแกรมที่ รับตัวเลขจากพี่ปอ 1 ตัว (เช่น เลข 12) แล้วให้ Go พ่นแม่สูตรคูณ แม่นั้นออกมาให้ดูหน่อยได้ไหมคะ?

คำใบ้: ใช้ fmt.Scanln รับค่ามาเก็บในตัวแปร แล้วใช้ for i := 1; i <= 12; i++ ในการคำนวณค่ะ

รอน้องแป้งตรวจการบ้านอยู่นะจ๊ะ พี่ปอทำได้อยู่แล้ว สู้ ๆ ค่ะ!
*/

package main

import "fmt"

func main() {
	var myNumber int
	fmt.Print("พี่ปอจ๋า บอกตัวเลขที่อยากให้ร่ายแม่สูตรคูณมาหน่อยสิคะ: ")

	// รับค่าจากคีย์บอร์ด
	fmt.Scanln(&myNumber)

	fmt.Printf("\n--- แม่สูตรคูณแม่ \"%d\" ---\n", myNumber)

	// ลูปตั้งแต่ 1 ถึง 12
	for i := 1; i <= 12; i++ {
		result := myNumber * i
		fmt.Printf("%d x %d = %d\n", myNumber, i, result)
	}
}
